CSI API ETABS v1
cAreaObj.SetMass Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetMass(
	string Name,
	double MassOverL2,
	bool Replace = false,
	eItemType ItemType = eItemType.Objects
)
Function SetMass (
	Name As String,
	MassOverL2 As Double,
	Optional Replace As Boolean = false,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim MassOverL2 As Double
Dim Replace As Boolean
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetMass(Name, MassOverL2,
	Replace, ItemType)
int SetMass(
	String^ Name,
	double MassOverL2,
	bool Replace = false,
	eItemType ItemType = eItemType::Objects
)
abstract SetMass :
        Name : string *
        MassOverL2 : float *
        ?Replace : bool *
        ?ItemType : eItemType
(* Defaults:
        let _Replace = defaultArg Replace false
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
MassOverL2
Type: System.Double
Replace (Optional)
Type: System.Boolean
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace